package ex05method;
/*
1.사용자가 입력한 2개의 시작값과 끝값사이에 있는
수를 모두 더하여 출력하는 프로그램을 작성하시오.
5/9 => 5 6 7 8 9 =>35
*/

/*
2.사용자로부터 2~9사이의 숫자중 2개를 입력받아
그에 해당하는 구구단을 출력하는 메소드를 작성하시오.
무조건 첫번째 입력받는수가 작아야한다.
입력예]
첫번째숫자 : 3
두번째숫자 : 12
3*1=3 3*2=6........
........
...................12*9=108
메소드명 : inputGugudan(int sNum, int su)
*/

/*
3. 인원수를 매개변수로 전달 받아 인원수 만큼 나이를 
입력받아 그 나이의 합을 반환하는 메소드를 작성하시오.
*/

/*
4.여러개의 숫자를 입력 받은 후 최대값을 구하는 메소드를
정의하시오. 단 숫자의 갯수는 매개변수로 전달 받고 숫자의 갯수만큼 Scanner클래스
를 통해 입력 받는다. 입력받은 숫자 중 최대값을 찾아서 반환하도록 정의한다.
*/


public class pratice923 
{

	public static void main(String[] args) 
	{  
		


	}

}
